app/controllers/books_controller.rb

  def create
  	@book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully."
  	  redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["body", "aaaa"], ["created_at", "2019-09-17 11:04:00.135882"], ["updated_at", "2019-09-17 11:04:00.135882"], ["user_id", 7]]
SELECT "books".* FROM "books"

  def show
    @posts = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def edit
    @post = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    @post = Book.find(params[:id])
    @post.update(post_params)
    if @post.update(post_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "キングダ"], ["updated_at", "2019-09-15 08:15:47.631516"], ["id", 5]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "zzzaz"], ["updated_at", "2019-09-17 04:24:37.382417"], ["id", 23]]

  def destroy
    @post = Book.find(params[:id])
    @post.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]