app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		@user = User.all

UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "gggd"], ["profile_image_id", nil], ["introduction", "aaaaaaaaaaaa"], ["updated_at", "2019-09-16 04:51:41.904590"], ["id", 6]]
---
	def update
		user = current_user
		if user.update(user_params)